#include <iostream>
#include "Point.h"

void bit_operations()
{
    int x = 3;
    int y = 10;

    // Размяна на стойностите на две целочислени променливи чрез побитови операции
    x = x ^ y;
    y = y ^ x;
    x = x ^ y;

    std::cout << "x=" << x << ", y=" << y << "\n";
}

void separate_compilation()
{
    // Използваме дефинираната в Point.cpp функция, чрез декларацията в Point.h
    std::cout << f() << "\n";
}

void structs()
{
    // Променлива от тип Point наричаме инстация (или обект),
    // къде то Point е структура (struct), някъде можете да видите термина "запис"
    Point pt;

    // Забележка: Ако Point няма зададени стойности по подразбиране за своите полета,
    // то при създаването на обект от този тип те (полетата) няма да бъдат инициализирани.
    //  т.е. няма да знаем каква стойност биха имали pt.x и pt.y

    // Достъпване на поле от обекта става чрез оператора "."
    pt.x = 6.2;
    pt.y = 2.2;

    // В паметта една след друга стоят "клетки" съдържащи стойностите на pt.x и pt.y,
    // взети заедно те образуват обекта pt.

    // Компилационна грешка - компилатора не знае как да изпринти обект от тип Point
    // std::cout << pt;

    // Нов обект от тип Point, със стойности съответно 3 и 8 за неговите x и y
    Point pt2{ 3, 8 };

    // Нов обект от тип Point, със стойности съответно 10 и 3 за неговите x и y
    Point pt3 = { 10, 3 };

    // Присвояване на стойността на обекта pt3 в pt2 (копиране)
    pt2 = pt3;

    // Всъщност вътрешно автоматично прави почленно присвояване на x и y:
    // pt2.x = pt3.x;
    // pt2.y = pt3.y;

    std::cout << pt.x << ", " << pt.y;

    // Както и с всяка друга променлива, можем да създаваме
    // указатели към обекти (променливи) от тип Point
    Point* ptrPt = &pt;

    // Всъщност ptrPt има стойност - адреса на първото поле
    // от структурата Point (x) за съответния обект pt.

    // Достъпване на поле на обект през указател става чрез оператора "->"
    ptrPt->x = 5;
    ptrPt->y = 6;

    (*ptrPt).x = 2;  // е еквивалентно на ptrPt->x = 2;
}

int main()
{
    bit_operations();
    separate_compilation();
    structs();

    return 0;
}
