/// Заглавен (header) файл

// Съдържа само* декларации.

// Не е особено важно с какво разширение е файла,
// стига да не е .cpp, .c++, .cc, .c и подобни.

// Добра практика е да се избере едно от .h или .hpp
// и да се използва консистентно за всички header файлове.

// Препроцесорна директива поддържана от повечето модерни компилатори.
// Предотвратява двойното include-ване.
#pragma once

// Препроцесорни директиви (header guard) поддържани от всики компилатори.
// Предотвратява двойното include-ване.
#ifndef POINT_HEADER
#define POINT_HEADER

int f();

// Декларация на нов тип (структура)
struct Point
{
    // Съдържа две полета (fields or members) от тип double,
    // със стойности по подразбиране - 0

    double x = 0;
    double y = 0;
};

// Края на header guard-a
#endif // POINT_HEADER
